# SpecificHeat Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ThermalAsset..::..SpecificHeat Property
ThermalAsset Class See Also
---
The specific heat of the asset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double SpecificHeat { get; set; }
```

Visual Basic
---
```text
Public Property SpecificHeat As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double SpecificHeat {
	double get ();
	void set (double value);
}
```

# Remarks
Values are in squared-feet per Kelvin, squared-second (ft²/(K · s²)) and must be non-negative.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for specificHeat must be non-negative. |

# See Also
ThermalAsset Class
Autodesk.Revit.DB Namespace